package com.kaiappgo.go;

import android.app.Activity;
import android.content.Intent;
import android.database.Cursor;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.widget.AdapterView;
import android.widget.Button;
import android.widget.EditText;
import android.widget.ListView;
import android.widget.SimpleCursorAdapter;
import android.widget.Toast;

import java.io.Serializable;

public class introductionActivity extends Activity {
    /* 自建的資料庫類別 */
    private MyDB db=null;

    ListView listview01;
    Cursor cursor;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_introduction);

        // 取 得元件
        listview01=(ListView)findViewById(R.id.ListView01);
        // 設定偵聽
        listview01.setOnItemClickListener(listview01Listener);

        db =new MyDB(this);       // 建立 MyDB 物件
        db.open();
        cursor=db.getAll();// 載入全部資料

        if(cursor.getCount() == 0)/*資料庫沒資料時寫入資料*/{
            db.append("動漫彩繪巷",24.1383556,120.6682569, "城市小巷中的大型彩繪，以熱門卡通和動漫人物為主。");
            db.append("美術園道",24.1359782,120.6606756," 許多美食餐廳裝潢擺設成為觀光景點，適合親子的開放空間，常有藝術展覽及公共設施供使用。");
            db.append("草悟道",24.1489591,120.661985,"草悟道是臺灣臺中市中心一整段大範圍的綠園道景觀計畫的統稱。範圍包含經國園道到美術園道之間綠帶，全長3.6公里。設計者為景觀建築事務所環藝工程顧問有限公司");
            db.append("老樹根魔法木工坊",24.1098401,120.6505694,"提供木工活動，設有花園和遊樂設施，博物館展品以木製品為主題。");
            db.append("柳川藍帶水岸",24.1425981,120.6748904,"喧鬧城市中乾淨舒服的河岸公園，夜景很漂亮，適合拍照踏青的好地方。");
            db.append("台中嘉明湖",24.1399668,120.6315159,"空曠沒遮蔽物，看夕陽和市區夜景的新地標，滑草，餵魚，野餐，簡單有趣。");
            db.append("彩虹村-Rainbow+Village",24.1336859,120.6076433,"在僅存的街道和退伍軍人村莊，畫上充滿活力、色彩繽紛的藝術創作。");
            db.append("鞋寶觀光工廠",24.1717121,120.6020059," 親子旅遊，DIY很棒，又有餐點飲料可以吃，認識鞋子製作發展的好地方。");
            db.append("20號倉庫藝術特區",24.1356783,120.681576,"過去的鐵路倉庫，現在改建為輪換駐場藝術家的展覽空間和工作室。");
            db.append("東光園道自行車道",24.1368123,120.6945348,"自行車道沿途有高大的小葉欖仁遮蔭，非常涼爽舒適。");
            db.append("台中金城武樹",24.1330764,120.6193826,"自然的田園風光，附近除了高架橋外，建築物較少，有一顆很像台東池上的金城武樹，加上旁邊的一邊綠油油，所組合而成的自然美景。");
            db.append("台灣氣球博物館",24.2473409,120.6968843,"位於氣球工廠且僅接受預約的博物館，提供旅遊、兒童活動和氣球製作課程。");
            db.append("3點1刻觀光工廠",24.1044841,120.6634265,"目前已更名為故事館。要前往參觀務必先預約，才能參觀到完整流程。");
            db.append("台中市長公館",24.1486909,120.6846283,"台中市長公館舊稱宮原氏別墅，原是日治時期活躍於臺灣政壇、醫界和教育界的日本人宮原武熊博士的別墅住宅。西元1945年第二次世界大戰結束後，日本人由台灣遣返回日本，宮原氏別墅也被臺中市政府接收做為市長官邸使用。根據歷史記載，從首任民選市長楊基先至第十任市長張子源曾居住於此官邸。");
            db.append("美仁里彩繪村",24.2358255,120.5576148,"一區老舊的建築社區裡欣賞著懷舊風情的彩繪別有一番風味。");
            db.append("審計新村",24.144701,120.6541985,"假日有年輕人文創小飾品的攤位，還有許多特色的店家。");
            db.append("九天黑森林",24.2294342,120.5952347,"農地附近的成樹營造出森林般的氛圍，廣受攝影師歡迎。");
            db.append("新社莊園古堡",24.1894919,120.810247,"獨樹一格的歐風城堡建築，適合欣賞享受。");
            db.append("摘星山莊",24.2241644,120.6946648,"摘星山莊位於臺灣臺中市潭子區潭富路二段八十八號，占地約二千四百四十坪，在地人稱之為「其中厝」，或稱「大豐村大瓦厝」，是傳說中臺灣協助平定清朝太平天國之役十八大老之一的林其中將軍所興建的宅第。");
            db.append("林之助紀念館",24.1412484,120.6712911,"很用心的紀念館，還可以看到林老師當年的書房畫室、作品，很值得來參觀。");
            db.append("中社觀光花市花海",24.3339762,120.7280982,"以幅員遼闊的花市和熱門外拍景點聞名，具有園圃造景和繽紛的花海。");
            db.append("台中市圓滿戶外劇場",24.1410043,120.6613311,"騎腳踏車、綠地野餐、直排輪、兒童遊樂區。");
            db.append("武陵農場",24.3523636,121.3064085,"武陵農場位於台灣台中市和平區平等里，是親近雪霸國家公園的重要遊憩據點，海拔1750公尺至2200公尺，為中華民國國軍退除役官兵輔導委員會所經營之公有事業。");
            db.append("國立台灣美術館",24.1412969,120.6612741,"國立臺灣美術館是中華民國唯一的國家級美術館，位於臺灣臺中市西區。1988年開館時為「臺灣省立美術館」，隸屬於臺灣省政府，1999年實行精省後，改隸行政院文化建設委員會。");
            db.append("921地震教育園區",24.0422614,120.6974316,"國立自然科學博物館九二一地震教育園區是國立自然科學博物館設在臺中市霧峰區光復新村的地震博物館。");
            db.append("高美濕地",24.3126986,120.5454083,"高美野生動物保護區是臺灣西海岸一處生態保護區，位於臺中市清水區西側，包括大甲溪出海口，綜合淡水注水與潮汐交替所構成的海岸溼地。");
            db.append("臺中國家歌劇院",24.1660386,120.639363,"時尚現代的大型音樂會場地，有各種表演、商店和餐館。");
            db.append("國立自然科學博物館",24.1572335,120.6638719,"廣大的科學博物館，設有 3D 劇院、植物園、恐龍、生態等各種展覽。");
            db.append("新社薰衣草森林",24.1284747,120.8391287,"很清幽的環境！是享受森林芬多精的好去處，但如果只是想賞花或散步，建議可以去心之芳庭就好。");
            db.append("大甲鎮瀾宮",24.345234,120.621377,"大甲鎮瀾宮，俗稱大甲媽祖廟、大甲媽，位於臺灣臺中市大甲區順天路158號，大甲火車站正前方200公尺處，主奉天上聖母媽祖，為台灣媽祖信仰的知名廟宇之一。");
            db.append("台中公園",24.144834,120.6822725,"台中歷史最悠久的都會公園，內有人工湖、跑道、網球場及遊憩場。");
            db.append("秋紅谷景觀生態公園",24.167257,120.6364623,"靜謐的都市綠地空間，以自然步道和充滿魚群、烏龜和鳥類的大型生態池聞名。");
            db.append("心之芳庭",24.1625381,120.765556,"風景漂亮，義大利麵、飲料好吃，湯還好，紀念品比較少，拍照的好地方。");
            db.append("大雪山森林遊樂區",24.1625221,120.6977049,"早年為臺灣中部地區重要的大雪山林場，森林植物生態豐富，包含分暖帶、溫帶、寒帶三種森林帶，各有其獨特的生態林相。");
            db.append("新社花海",24.1892058,120.7559168,"新社花海是台灣中部地區一座花卉景點區，位於台中市新社區境內，為農委會種苗改良繁殖場經營第二苗圃。");
            db.append("麗寶樂園",24.3230546,120.6933353,"遊客眾多的主題樂園，主打雲霄飛車、多種遊樂設施、人工波浪池和飄飄河。");
            db.append("鰲峰山運動公園",24.2731933,120.5817402,"設施有創意，且場地大，適合親子活動。");
            db.append("台中都會公園",24.2078278,120.5966274,"臺中都會公園在設計理念上定位為「都會森林公園」，提供大型開放空間、廣大的綠地、綠美化的視覺景觀、多樣性的遊憩活動，以及自然資源等多種功能。");
            db.append("寶覺寺",24.1593116,120.6857111,"1926年創建，開山者為良達法師，首任主持妙禪法師，臺日二戰軍人與遺屬會來此祭祀，也為日本觀光客旅遊地點。");
            db.append("勤美術館",24.152359,120.6613743,"戶外的當代美術館，有固定雕塑、特殊展品，和一間咖啡館。");
            db.append("香蕉新樂園",24.1561695,120.6877853,"喝飲料、吃冰、拍照、復古場景、老東西展覽 ，蠻懷舊 彷彿時光隧道。");
            db.append("新盛綠川水岸廊道",24.138576,120.6817536,"綠川很美，整治之後是個很適合吹風散步的地方。");
            db.append("福壽山農場",24.2457922,121.2451265,"休閒渡假賞楓賞櫻露營的好地方，採蘋果買高山茶豐富的生態之旅。");
            db.append("光復新村",24.6914543,120.8717102,"光復新村位於臺灣台中市霧峰區坑口里，其歷史可追溯到1950年代初期，退守台灣的中華民國政府，為了防止戰爭時一次就將政府機關摧毀，因此推動「疏遷計畫」，把台灣省政府遷到臺灣中部。");
            db.append("台中文學館",24.13968,120.6705753,"古色古香日式風格建築，兒童文學，文藝餐廳，接近大自然。");
            db.append("台中文化創意產業園區",24.1329271,120.6787048,"位於老啤酒廠的文化公園，展示當代建築師和設計師的作品。");
            db.append("新社莊園",24.189487,120.810247,"獨樹一格的歐風城堡建築，跟朋友聚會談心，放鬆身心的好地方。");
            db.append("大坑4號步道",24.1894867,120.8036809,"大坑四號步道是老少咸宜的一條步道且風景很優美。");
            db.append("台中萬和宮",24.1377871,120.6370647,"昔日打製犁頭等農具店舖聚集的「犁頭店街」而得名，奉祀湄洲天上聖母，為臺中市的四大媽祖廟之一。");
            db.append("谷關溫泉公園",24.2032881,121.0045951,"給遊客可以免費感受足湯的好地方。");
            db.append("市民廣場",24.1499989,120.6612997,"地方寬闊，交通便利，親子活動很好的地方。");
            db.append("樂成宮",24.1407017,120.6958302,"位於臺灣臺中市東區旱溪里的媽祖廟，其媽祖被稱為「旱溪媽祖」，建築與遶境分別被列為臺中市文化資產的古蹟、無形文化資產。");
            db.append("萬春宮",24.1422026,120.6792576,"台中萬春宮，舊名藍興宮，是位於臺灣臺中市中區光復里的媽祖廟，媽祖被稱為「台中媽」、「藍興媽祖」。");
            db.append("益民一中商",24.1531828,120.6844673,"位於益民一中商圈裡的台中青蘋果3C擁有專業的收購買賣，同時是  二手手機專賣店、 二手鏡頭專賣店 、 二手數位相機專賣店 ，以及二手Rimowa行李箱與禮卷收購的好地方。");
            db.append("泰安鐵道文化園區",24.3226874,120.7468306,"濃厚的山城鐵道氛圍，吸引多位婚紗新人拍照，賞櫻季節的熱門景點。");
            db.append("東勢林場",24.285276,120.8654623,"悠閒的自然區域，內有野生動物、溫泉、步道和導覽行程。");
            db.append("台中植物園",24.1581157,120.665989,"園內植物林立，配合生態造景，及假日導說餵魚秀，園區外草地植被，適合親子同遊。");
            db.append("石岡水壩",24.2813052,120.7673051,"東豐自行車道中的一個景點，橫跨大甲溪的水壩，提供台中市主要水源區。");
            db.append("台中港",24.2880977,120.5018817,"臺中港是位於臺灣臺中市的一個國際商港，十大建設的重要項目之一，距離北部基隆港和南部高雄港各約110海里。");
            db.append("寶熊漁樂館",24.220301,120.7037593,"是臺中市的一個體驗吊魚的熱點並有世界上最高階級具是友的好去處");
            db.append("民俗公園",24.220301,120.7037593,"文化博物館，有歷史悠久的台灣文物，如刺繡和家居用品，另有餐館。");
            db.append("忘憂谷",24.3085037,120.6452529,"風景果然漂亮，是個悠閒又能欣賞夕陽美景的好去處。");
            db.append("台中市港區藝術中心",24.2707234,120.5556053,"館區展覽館動線清楚，表演廳常常有音樂演奏，是適合文化知性的好場地。");
            db.append("鳶嘴稍來山步道",24.2375923,120.9626902,"鳶嘴稍來步道是一條十分經典的爬山行程，建議要衡量體力。");
            db.append("新天地西洋博物館",24.1419258,120.6994154,"導覽很親切，會有聲有色的解說從蘇富比拍賣會帶回來的藝術品，彷彿見證了那奢華浮誇的年代。");
            db.append("紫雲巖",24.2711225,120.5770993,"富有人文氣息，從廟宇建築即可窺見其他祖師爺廟宇的一脈，與北台灣三峽祖師廟互有千秋。");
            db.append("磺溪書院",24.1487233,120.5374558,"台中海線南端，接近彰化的清代史蹟，也代表了大肚下街、下寮仔尾地區文風鼎盛之區。");
            db.append("武陵森林遊樂區",24.4005628,121.3034417,"風景秀麗，空氣好，四季均可觀賞各種當季花卉，山上無光害，觀星好地點。");
            db.append("新都生態公園",24.1735169,120.7274954,"小而美的公園 可以帶小朋友逛逛 餵魚看鴿子放風箏野餐偶爾有街頭藝人表演。");
            db.append("梧棲漁港",24.2922473,120.51582,"梧棲漁港朝向生產、休閒、觀光方向發展，間接帶動港區周邊繁榮的發展，其中休閒動線連成一脈，內部則有漁港景觀、遊憩碼頭，成為中部人們享受海鮮、濱海休閒生活的最好去處。另外區內規劃的設施包含：體能活動區、沙灘排球區、放風箏區、觀海區和野餐區…等等。散步、放風箏、玩飛盤，欣賞碼頭的風光，此外漁市外小吃攤處處林立，也常常吸引不少遠道而來的饕客，目前也有「藍色公路」的海上遊艇提供遊客乘坐。");
            db.append("南天宮",24.1428558,120.6931775,"一間靈驗的關聖帝君，教導大家要文武兼備，允文允武。可以點藥師燈，文昌燈，帝君燈跟財神燈。");
            db.append("后里花田拼布公園",24.2879193,120.7020289,"全家出遊賞花的好地方,有免費接駁車,公廁多,美食及當地特色農產品。");
            db.append("馬拉灣水上樂園",24.323997,120.69456,"樂園區的設施多樣化夏季玩水抗暑好去處。");
            db.append("台鐵新烏日文創商圈",24.1097855,120.612825,"於高鐵台中站與台鐵新烏日站之間的空間，由台鐵規劃了屬於火車文化的空間。");
            db.append("龍井麗水漁港",24.1990202,120.4959279,"台中最南端龍井區一處有著希臘地中海風情的藍白特色建築休憩亭，新人婚紗取景的浪漫地方。");
            db.append("圳前仁愛公園",24.2583896,120.6462892,"適合全家同遊的飛機主題公園，有小朋友喜歡的沙坑、體健設施，還有親水區。");
            db.append("霧峰落羽松林",24.0166325,120.6848587,"很迷你的景點，景觀普通。偶見新人出外景至此取景，拍攝婚紗攝影。");
            db.append("元保",24.1628953,120.6740565,"元寶宮是保生大帝的宮廟，也是在台中市一間讓民眾祈求保平安身體健康的宗教廟宇。");
            db.append("孫立人將軍紀念館",24.1469463,120.6656433,"聆聽導覽解說，在平靜日式官舍中，一代豪傑就困在這一方天地。 ");
            db.append("葫蘆墩公園",24.2592601,120.7183453,"整體規劃完善，視野廣闊，風景獨特，適合全家大小遊樂的好地方。");
            db.append("大墩文化中心",24.1414583,120.6637983,"有圖書館、展覽和電影放映，旁邊有河堤，風景還不錯，而且又相鄰國立台灣美術館。");
            db.append("公老坪教育休閒農場",24.2625725,120.7595555,"戶外草地，遊樂設施，適合親子。食物好吃，桌菜好吃擺盤用心。");
            db.append("后里馬場",24.2989375,120.732615,"場區規劃很詳細，風景也很漂亮，尤其馬術表演更是精彩，很棒的地方。");
            db.append("新田登山步道",24.214271,120.7357746,"登山健行，山頂視野佳，沿途植物生態豐富。");
            db.append("東協廣場",24.1392125,120.6818166,"夜晚的都市美景盡收眼底 人潮眾多與異地美食小吃眾多 適合舉家夜晚休閒的地方。");
            db.append("葫蘆墩文化中心",24.2528099,120.7280012,"四層樓的文化中心，有數個畫廊和一個大型的現代化圖書館、劇院和活動場地。");
            db.append("牛罵頭遺址文化園區",24.2682517,120.5783249,"適合運動，親子活動，烤肉，賞夜景的好地方。");
            db.append("郭叔叔獼猴生態區",24.173378,120.7873063,"適合小小孩。導覽解說詳細，餵食秀讓人印象深刻。");
            db.append("慈濟公園",24.2574572,120.7310459,"有停車場，環境舒適，可以溜小孩，餵魚，沙坑，兒童設施，樹迷宮，適合全家旅遊。");
            db.append("霧峰農會酒莊",24.0385726,120.6907604,"內有寬敞開闊的伴手禮展售區，酒類產品也可以試喝，介紹酒類產品。");
            db.append("八仙山森林遊樂區",24.1919103,121.013015,"避暑，環境生態教育的好地方， 適合全家出遊，團康活動地點。");
            db.append("東勢客家文化園區",24.25765,120.8296613,"充滿客家風格的特色，又保有修澤蘭建築師的建築特色，館內展覽也具有豐富客家創意。");
            db.append("張連昌薩克斯風紀念館",24.3123849,120.6923962,"一個台灣獨特的音樂樂器製造的地方。");
            db.append("臺中市屯區藝文中心",24.1568615,120.7328292,"臺中市屯區藝文中心是位於臺灣臺中市太平區大興路與長安東路口的藝文場所。由於台中市區幅員廣大，為了均衡山海屯各區域文化的發展，台中市屯區藝文中心肩負屯區藝文發展的重任。");
            db.append("捎來步道",24.2056354,121.0035384,"全長1300公尺休閒步道，步道位於台中市和平區谷關風景區。");
            db.append("安妮古堡花園",24.1681345,120.8291555,"環境優美，是女孩喜歡的夢幻世界，適合拍照的場地，小西點飲料都很有特色，值得參訪。");
            db.append("舊社里彩繪村",24.2939316,120.6998544,"這個小鎮充滿藝術家的作品，很適合打卡拍照的好景點。");
            db.append("南屯犁頭店生活館",24.1362869,120.6367692,"南屯犁頭店地方文化館來作為南屯區社區資訊中心，依現有活動中心及廢棄宿舍，利用社區閒置空間，籌設社區生活館，增加社區居民情感交流空間。");
            db.append("味噌釀造文化館",24.234232,120.6984023,"提倡食農教育，讓更多人了解認識釀造食品（味噌、醬油、醬菜）為健康食物透過教師體 驗營良性互動，教學相長。");
            db.append("大安濱海樂園",24.3804483,120.5828164,"台中夏季限定的海水浴場，大安濱海旅客服務中心 提供兩大區的戲水區、盥洗室、停車場等親子設施。");
        }

        cursor=db.getAll();// 載入全部資料
        UpdateAdapter(cursor);  // 載入資料表至 ListView 中
    }

    private ListView.OnItemClickListener listview01Listener = new ListView.OnItemClickListener(){
        public void onItemClick(AdapterView<?> parent, View v,
                                int position, long id) {
            cursor.moveToPosition(position);

            /*導到childintro*/
            Intent intent=new Intent();
            intent.setClass(introductionActivity.this,ChildIntroductionActivity.class);

            Bundle bundle=new Bundle();
            bundle.putInt("_id", db.get(id).getInt(0));
            bundle.putString("name", db.get(id).getString(1));
            bundle.putDouble("addr1", db.get(id).getDouble(2));
            bundle.putDouble("addr2", db.get(id).getDouble(3));
            bundle.putString("context", db.get(id).getString(4));

            intent.putExtras(bundle);
            startActivity(intent);
        }
    };

    @Override
    protected void onDestroy(){
        super.onDestroy();
        db.close(); // 關閉資料庫
    }

    public void UpdateAdapter(Cursor cursor){
        if (cursor != null && cursor.getCount() >= 0){
            SimpleCursorAdapter adapter = new SimpleCursorAdapter(this, android.R.layout.simple_list_item_1, cursor, new String[] { "name"}, new int[] { android.R.id.text1}, 0);
            listview01.setAdapter(adapter); // 將adapter增加到listview01中
        }
    }
}